WELCOME_TEXT = "Қош келдіңіз! / Добро пожаловать! / Хуш келибсиз "
CHOOSE_LANG = "Тілді таңдаңыз! / Выберите язык! / Тилни танланг"
BTN_LANG_UZ = "Ўзбек тили"
BTN_LANG_RU = "Русский язык"
BTN_LANG_KZ= "Қазақ тілі"

STATES = {
    "reg": 1,
    "menu": 2,
    "settings": 3
}

LANGUAGE_CODE = {
    1: "uz",
    2: "ru",
    3: "kz"
}

TEXT_LANG_WARNING = (
    "Илтимос, тиллардан бирини танланг!\n"
    "Пожалуйста, выберите один из языков!\n"
    "Өтінемін, тілдердің бірін таңдаңыз!"
)

TEXT_ENTER_FIRST_NAME = {
    1: "Илтимос, исмингизни киритинг!",
    2: "Пожалуйста, введите ваше имя!",
    3: "Өтінемін, атыңызды енгізіңіз!"
}

TEXT_ENTER_LAST_NAME = {
    1: "Илтимос, фамилиянгизни киритинг!",
    2: "Пожалуйста, введите свою фамилию!",
    3: "Өтінемін, тегіңізді енгізіңіз!"
}

BTN_SEND_CONTACT = {
    1: "Юбориш",
    2: "Отправить",
    3: "Жіберу"
}

TEXT_ENTER_CONTACT = {
    1: "Илтимос, телефон рақамингизни юборинг ёки <<Юбориш>> тугмасини босинг!",
    2: "Отправьте свой номер телефона или нажмите кнопку <<Отправить>>!",
    3: "Өтінемін, телефон нөміріңізді жіберіңіз немесе <<Жіберу>> батырмасын басыңыз!"
}

TEXT_MAIN_MENU = {
    1: "🏠 Асосий меню",
    2: "🏠 Главное меню",
    3: "🏠 Басты мәзір"
}

BTN_ORDER = {
    1: "🛒 Буюртма қилиш",
    2: "🛒 Заказать",
    3: "🛒 Тапсырыс беру"
}

TEXT_ORDER = {
    1: "Категориялардан бирини танланг!",
    2: "Выбери одну из категорий!",
    3: "Санаттардың бірін таңдаңыз!"
}

BTN_MY_ORDERS = {
    1: "🛍 Буюртмаларим",
    2: "🛍 Мои заказы",
    3: "🛍 Менің тапсырыстарым"
}

BTN_ABOUT_US = {
    1: "👨‍👩‍👦 Биз хақимизда",
    2: "👨‍👩‍👦 О нас",
    3: "👨‍👩‍👦 Біз жайлы"
}

BTN_KORZINKA = {
    1: "🛍 Харид қилиш",
    2: "🛍 Покупка товаров",
    3: "🛍 Сатып алу"
}


BTN_SETTINGS = {
    1: "⚙️ Созламалар",
    2: "⚙️ Настройки",
    3: "⚙️ Баптаулар"
}

########## lesson-3 ###########
TEXT_PRODUCT_PRICE = {
    1: "Нарх:",
    2: "Цена:",
    3: "Баға:"
}

TEXT_PRODUCT_DESC = {
    1: "Таркиби:",
    2: "Состав:",
    3: "Құрамы:"
}
###########################

# lesson-4 ##############
AT_KORZINKA = {
    1: "Саватчада",
    2: "В корзине",
    3: "Себетте"
}

ALL = {
    1: "Жами",
    2: "Все",
    3: "Барлығы"
}

ZAKAZ = {
    1: "Буюртма",
    2: "Заказ",
    3: "Тапсырыс"
}

SUM = {
    1: "тенге",
    2: "тенге",
    3: "теңге"
}

ABOUT_COMPANY = {
    1: "Biz <b> AziaX </b> Fast Food markazimiz. "
       "\n\nBizning xizmatimiz sizga zakazlaringizni shirin "
       " va tez etkazib berish!\n\n"
       "<b>BIZ SIZ HAQINGIZDA QAYG'URAMIZ!!!</b>",
    2: "Мы центр <b> AziaX </b> Fast Food.!"
       "\n\nНаш сервис доставит ваши заказы вкусно"
       " и быстро! \n\n"
       "<b>МЫ ЗАБОТИМСЯ О ВАС !!!</b>",
    3: "Біз <b> AziaX </b> Fast Food орталығымыз!"
       "\n\nБіздің қызметіміз сізге тапсырыстарыңызды тәтті"
       " және жылдам жеткізіп берy!!\n\n"
       "<b>БІЗ СІЗ ТУРАЛЫ ҚАМ ЖЕЙМІЗ!!!</b>"
}

NO_ZAKAZ = {
    1: "Сиз xали бирорта буюртма бермагансиз!",
    2: "Вы еще не разместили ни одного заказа!",
    3: "Сіз әлі бірде-бір тапсырыс берген жоқсыз!"
}

SEND_LOCATION = {
    1: "📍 Локация жўнатинг",
    2: "📍 Отправить местоположение",
    3: "📍 Орналасуды жіберіңіз"
}

ZAKAZ_OL = {
    1: "Буюртма бериш",
    2: "Сделать заказ",
    3: "Тапсырыс беру"
}

ZAKAZ_OL_OL = {
    1: "Саватчани бўшатиш",
    2: "Очистить корзину",
    3: "Себетті босату"
}

ZAKAZ_OL_OL_OL = {
    1: "Ортга",
    2: "Назад",
    3: "Артқа"
}

PUL = {
    1: "Нақд пул",
    2: "Наличные деньги",
    3: "Қолма-қол ақша"
}

PULL = {
    1: "Kaspi.kz",
    2: "Kaspi.kz",
    3: "Kaspi.kz"
}

MALUM = {
    1: "Маълумотларим:",
    2: "Мои данные:",
    3: "Мағлұматтарым:"
}

NAME = {
    1: "Исм-фамилия:",
    2: "Имя-фамилия:",
    3: "Аты-жөні:"
}

NUMBER = {
    1: "Телефон рақам:",
    2: "Номер телефона:",
    3: "Телефон нөмірі:"
}

ZAKAZZ = {
    1: "Буюртмаларим:",
    2: "Мои заказы:",
    3: "Тапсырыстарым:"
}
BUYURTMA = {
    1: "Буюртмангиз қабул қилинди. Рахмат.",
    2: "Ваш заказ принят. Спасибо.",
    3: "Тапсырысыңыз қабылданды. Рахмет."
}

##############